//相同的不管
//不同的情况有两种，xy,yx.分别记录下两种情况的个数为m,n

//若m和n为偶数则进行(m+n)/2次交换
//若m和n为奇数则进行(m-1+n-1)/2+2==(m+1)/2+(n+1)/2次交换
//C语言的除法运算省略小数，m/2+n/2=(m+n)/2=(m+1)/2+(n+1)/2
int minimumSwap(char * s1, char * s2)
{
 

	int len=strlen(s1),xy=0,yx=0;
	for (int i=0;i<len;i++)
	{
		if (s1[i]=='x' && s2[i]=='y')
        {
            xy++;
        }
		if (s1[i]=='y' && s2[i]=='x')
        {
            yx++;
        }
	}
	if ((xy+yx)%2!=0)//特殊情况交换字符无法相等时,既两字符串单个x或y为奇数时
    {
        return -1;//既两字符串单个x或y为奇数时，返回-1
    }
	return (xy+1)/2+(yx+1)/2;   //最后交换次数
    
}
